#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//移位操作符

//int main()
//{
//	int a = 10;
//	int b=a >> 2;
//	printf("%d\n", a);
//	printf("%d\n", b);
//	return 0;
//}

//位操作符

//int main()
//{
//	int a = 1;//00000001
//	int b = 2;//00000010
//	int c = a & b;//00000000
//	int d = a | b;//00000011
//	int e = a ^ b;//00000011
//	printf("%d\n", c);
//	printf("%d\n", d);
//	printf("%d\n", e);
//	return 0;
//}

//int main()
//{
//	int a = 13;
//	//把a的二进制中的第5位置成1
//	a = a | (1 << 4);
//	printf("a = %d\n", a);//29
//	//把a的二进制中的第5位置成0
//	a = a & ~(1 << 4);
//	printf("a = %d\n", a);//13
//	//00000000000000000000000000001101
//	//00000000000000000000000000010000
//	//00000000000000000000000000011101
//	// 	                          
//	//1<<4
//	//00000000000000000000000000000001
//
//	//00000000000000000000000000011101
//	//11111111111111111111111111101111
//	//00000000000000000000000000010000
//	//00000000000000000000000000001101
//	//1<<4
//	return 0;
//}


//求一个整数存储在内存中的二进制中1的个数

//

//int main()
//{
//	printf("%d\n", !2);//非真
//
//	printf("%d\n", !0);//非假
//
//	return 0;
//}

//360笔试题

//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;
//	//i = a++||++b||d++;
//	printf("a = %d\n b = %d\n c = %d\nd = %d\n", a, b, c, d);
//	return 0;
//}

int main()
{
	int a = 3;
	int b = 5;
	short s = 5;
	printf("%d", sizeof(s = a + 3));
	a + b;//值属性，类型属性 int
	return 0;
}
